
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>1.1 JDK Flight Recorder · 入門: JDK Flight Recoder</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="02-other_tools.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    目次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface.html">
            
                <a href="../preface.html">
            
                    
                    はじめに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1章　JDK Flight Recoder とは？
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="01-what_is_JFR.html">
            
                <a href="01-what_is_JFR.html">
            
                    
                    1.1 JDK Flight Recorder
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="02-other_tools.html">
            
                <a href="02-other_tools.html">
            
                    
                    1.2 Javaにおけるパフォーマンス分析と障害診断
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="03-history_of_jfr.html">
            
                <a href="03-history_of_jfr.html">
            
                    
                    1.3 JFRの歴史 - JRockitからOpenJDKまで
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="04-install_jmc.html">
            
                <a href="04-install_jmc.html">
            
                    
                    1.4 JFRの動作環境とJMCのインストール
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2章　JDK Flight Recorderのアーキテクチャ
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../02/01-jfr-architecture.html">
            
                <a href="../02/01-jfr-architecture.html">
            
                    
                    2.1 JFRのアーキテクチャ概要
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" >
            
                <span>
            
                    
                    2.2 JFRとオーバーヘッド
            
                </span>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" >
            
                <span>
            
                    
                    3章　JDK Flight Recorderの記録
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../03/01-recording-jfr.html">
            
                <a href="../03/01-recording-jfr.html">
            
                    
                    3.1 JDK Flight Recorderの記録
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" >
            
                <span>
            
                    
                    6章　Flight Record API
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../06/01-what_is_JFR_api.html">
            
                <a href="../06/01-what_is_JFR_api.html">
            
                    
                    6.1 Flight Recorder APIとは？
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.1 JDK Flight Recorder</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="11-jdk-flight-recoder">1.1 JDK Flight Recoder</h1><h2 id="&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;profiling&#x3068;&#x8A3A;&#x65AD;diagnosis">&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;(Profiling)&#x3068;&#x8A3A;&#x65AD;(Diagnosis)</h2><p>JDK Flight Recoder(JFR)&#x306F;Java&#x3067;&#x5229;&#x7528;&#x3067;&#x304D;&#x308B;<strong>&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;(Profiling)</strong>&#x3068;<strong>&#x8A3A;&#x65AD;(Diagnosis)</strong>&#x306E;&#x70BA;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;</p><p>&#x3082;&#x3046;&#x5C11;&#x3057;&#x3001;&#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x306B;&#x8A00;&#x3048;&#x3070;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x306E;&#x652F;&#x63F4;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;JFR&#x3067;&#x306F;CPU&#x3084;&#x30E1;&#x30E2;&#x30EA;&#x306A;&#x3069;&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x306E;&#x4F7F;&#x7528;&#x72B6;&#x6CC1;&#x3084;GC&#x306E;&#x72B6;&#x614B;&#x3001;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x306E;&#x30ED;&#x30C3;&#x30AF;&#x3084;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x306A;&#x3069;&#x69D8;&#x3005;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x5206;&#x6790;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x4EE5;&#x524D;&#x306F;Oracle JDK&#x306E;&#x5546;&#x7528;&#x30B5;&#x30DD;&#x30FC;&#x30C8;(Java SE Advanced)&#x307E;&#x305F;&#x306F;Weblogic&#x7B49;&#x306E;&#x5546;&#x7528;&#x88FD;&#x54C1;&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;&#x3044;&#x308B;&#x30AB;&#x30B9;&#x30BF;&#x30DE;&#x30FC;&#x5411;&#x3051;&#x306E;&#x6A5F;&#x80FD;&#x3067;&#x3057;&#x305F;&#x304C;&#x3001;OpenJDK11&#x306B;Oracle&#x3088;&#x308A;&#x5BC4;&#x8D08;&#x3055;&#x308C;&#x305F;&#x306E;&#x3067;&#x73FE;&#x5728;&#x306F;&#x8AB0;&#x3067;&#x3082;&#x81EA;&#x7531;&#x306B;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x592A;&#x3063;&#x8179;&#x3067;&#x3059;&#x306D;&#xFF01;</p><p>&#x3055;&#x3066;&#x3001;&#x4F55;&#x6545;&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x5FC5;&#x8981;&#x304B;&#x3068;&#x8A00;&#x3046;&#x3068;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x969C;&#x5BB3;&#x3084;&#x6027;&#x80FD;&#x9045;&#x5EF6;&#x306E;&#x5206;&#x6790;&#x3092;&#x3059;&#x308B;&#x70BA;&#x3067;&#x3059;&#x3002;</p><p>&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30ED;&#x30B0;&#x306B;&#x5206;&#x6790;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x3092;&#x968F;&#x6642;&#x51FA;&#x3057;&#x3066;&#x304A;&#x304F;&#x3001;&#x3068;&#x8A00;&#x3046;&#x3053;&#x3068;&#x3082;&#x5F53;&#x7136;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x306E;&#x554F;&#x984C;&#x3084;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x304C;&#x81A8;&#x5927;&#x306B;&#x306A;&#x308B;&#x306E;&#x3067;&#x4F55;&#x304B;&#x3057;&#x3089;&#x306E;&#x5C02;&#x7528;&#x30C4;&#x30FC;&#x30EB;/&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3067;&#x3059;&#x3002;</p><p>&#x6975;&#x3081;&#x3066;&#x985E;&#x4F3C;&#x3057;&#x305F;&#x6982;&#x5FF5;&#x306B;<strong>&#x76E3;&#x8996;(Monitoring)</strong>&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4F8B;&#x3048;&#x3070;CPU&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x3084;&#x30E1;&#x30E2;&#x30EA;&#x306E;&#x72B6;&#x614B;&#x306A;&#x3069;&#x306F;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x306B;Zabbix&#x3084;Datadog&#x3068;&#x3044;&#x3063;&#x305F;&#x76E3;&#x8996;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x30E2;&#x30CB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x3055;&#x308C;&#x95BE;&#x5024;&#x3092;&#x8D8A;&#x3048;&#x308B;&#x3068;&#x30A2;&#x30E9;&#x30FC;&#x30C8;&#x304C;&#x98DB;&#x3076;&#x4ED5;&#x7D44;&#x307F;&#x306F;&#x4E00;&#x822C;&#x7684;&#x3060;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;New Relic&#x3084;Dynatrace&#x306A;&#x3069;&#x306E;&#x3088;&#x3046;&#x306A;<strong>Application Perfomance Monitor(APM)</strong>&#x306F;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x6027;&#x80FD;&#x76E3;&#x8996;&#x306B;&#x7279;&#x5316;&#x3057;&#x3066;&#x3044;&#x3066;&#x3001;&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x306E;&#x9045;&#x5EF6;&#x306E;&#x30E2;&#x30CB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x306F;&#x3082;&#x3061;&#x308D;&#x3093;&#x3001;&#x5206;&#x6563;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x6A5F;&#x80FD;&#x3084;&#x30C9;&#x30EA;&#x30EB;&#x30C0;&#x30A6;&#x30F3;&#x5206;&#x6790;&#x306B;&#x3088;&#x308B;&#x9045;&#x5EF6;&#x7B87;&#x6240;&#x306E;&#x7279;&#x5B9A;&#x306E;&#x3088;&#x3046;&#x306A;&#x8A3A;&#x65AD;&#x6A5F;&#x80FD;&#x306A;&#x3069;&#x3082;&#x5099;&#x3048;&#x3066;&#x304A;&#x308A;&#x30DE;&#x30A4;&#x30AF;&#x30ED;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x904B;&#x7528;&#x306B;&#x306F;&#x6B20;&#x304B;&#x305B;&#x306A;&#x3044;&#x3082;&#x306E;&#x3068;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x3053;&#x306E;&#x3088;&#x3046;&#x306B; <strong>&#x300C;&#x6027;&#x80FD;&#x3092;&#x8A3A;&#x308B;&#x300D;</strong> &#x3068;&#x8A00;&#x3046;&#x70B9;&#x3067;&#x306F;Monitoring&#x3068;Profiling/Diagnosis&#x306F;&#x898B;&#x3066;&#x308B;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x306F;&#x540C;&#x3058;&#x306A;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3068;&#x76EE;&#x7684;&#x304C;&#x9055;&#x3044;&#x307E;&#x3059;&#x3002;&#x57FA;&#x672C;&#x7684;&#x306B;&#x306F;Monitoring&#x306E;&#x30ED;&#x30FC;&#x30EB;&#x306F; <strong>&#x300C;&#x554F;&#x984C;&#x304C;&#x8D77;&#x3053;&#x3063;&#x3066;&#x3044;&#x308B;&#x4E8B;&#x3092;&#x767A;&#x898B;&#x3059;&#x308B;&#x300D;</strong> &#x3067;&#x3042;&#x308A; <strong>&#x300C;&#x554F;&#x984C;&#x304C;&#x8D77;&#x3053;&#x3063;&#x3066;&#x3044;&#x308B;&#x6700;&#x4E2D;&#x306B;&#x5229;&#x7528;&#x3055;&#x308C;&#x308B;&#x3082;&#x306E;&#x300D;</strong>&#x3067;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3001;Profiling/Diagnosis&#x306F; <strong>&#x300C;&#x554F;&#x984C;&#x7B87;&#x6240;&#x306E;&#x7279;&#x5B9A;&#x3068;&#x5206;&#x6790;&#x300D;</strong>&#x304C;&#x30ED;&#x30FC;&#x30EB;&#x3068;&#x306A;&#x308A; <strong>&#x300C;&#x554F;&#x984C;&#x304C;&#x8D77;&#x3053;&#x3063;&#x305F;&#x5F8C;&#x306B;&#x5229;&#x7528;&#x3055;&#x308C;&#x308B;&#x3082;&#x306E;&#x300D;</strong>&#x3067;&#x3059;&#x3002;</p><p>&#x3053;&#x306E;&#x9055;&#x3044;&#x306F;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x306E;&#x7279;&#x5FB4;&#x306E;&#x9055;&#x3044;&#x306B;&#x3082;&#x306A;&#x308A;&#x307E;&#x3059;&#x304C;&#x3001;APM&#x306F;Monitoring&#x3092;&#x4E3B;&#x773C;&#x3068;&#x3057;&#x3064;&#x3064;&#x3082;Profiling/Diagnosis&#x3092;&#x53D6;&#x308A;&#x8FBC;&#x3093;&#x3060;&#x7D71;&#x5408;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3057;&#x3001;&#x8907;&#x6570;&#x306E;&#x30ED;&#x30FC;&#x30EB;&#x3092;&#x517C;&#x306D;&#x5099;&#x3048;&#x305F;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x3044;&#x3046;&#x306E;&#x306F;&#x3053;&#x306E;&#x5206;&#x91CE;&#x306B;&#x9650;&#x3089;&#x305A;&#x4E00;&#x822C;&#x7684;&#x306A;&#x306E;&#x3067;&#x6DF7;&#x4E71;&#x3057;&#x3066;&#x3057;&#x307E;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;</p><p>&#x306A;&#x306E;&#x3067;&#x3001;&#x591A;&#x5C11;&#x3059;&#x3067;&#x306B;&#x5C0E;&#x5165;&#x6E08;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x88AB;&#x3063;&#x3066;&#x308B;&#x6A5F;&#x80FD;&#x304C;&#x3042;&#x3063;&#x3066;&#x3082;&#x300C;&#x81EA;&#x5206;&#x305F;&#x3061;&#x304C;&#x4F55;&#x306E;&#x70BA;&#x306B;&#x5C0E;&#x5165;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#xFF1F;&#x300D;&#x3092;&#x3057;&#x3063;&#x304B;&#x308A;&#x898B;&#x636E;&#x3048;&#x3066;&#x76EE;&#x7684;&#x306B;&#x5408;&#x3063;&#x305F;&#x30C4;&#x30FC;&#x30EB;&#x3092;&#x9078;&#x629E;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x91CD;&#x8981;&#x3067;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;JFR&#x306F;&#x6027;&#x80FD;&#x554F;&#x984C;&#x3092;&#x542B;&#x3080;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x306E;&#x70BA;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x306A;&#x306E;&#x3067;&#x305F;&#x3068;&#x3048;&#x3070;&#x539F;&#x56E0;&#x4E0D;&#x660E;&#x306E;&#x30D0;&#x30C3;&#x30C1;&#x306E;&#x505C;&#x6B62;&#x3084;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x306E;&#x7570;&#x5E38;&#x7D42;&#x4E86;&#x306B;&#x3082;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x3053;&#x306E;&#x8FBA;&#x308A;&#x306F;APM&#x3092;&#x5C0E;&#x5165;&#x3057;&#x3066;&#x3044;&#x3066;&#x3082;Profiling&#x3084;Diagnosis&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x3063;&#x3066;&#x304F;&#x308B;&#x7406;&#x7531;&#x3067;&#x3059;&#x3002;</p><h2 id="jdk-flight-recoderjfr&#x306E;&#x7279;&#x5FB4;">JDK Flight Recoder(JFR)&#x306E;&#x7279;&#x5FB4;</h2><p>JFR&#x306F;JVM&#x306B;&#x7D44;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x3068;&#x8A00;&#x3046;&#x30C1;&#x30FC;&#x30C8;&#x7684;&#x306A;&#x6A5F;&#x80FD;&#x306A;&#x305F;&#x3081;&#x975E;&#x5E38;&#x306B;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x304C;&#x975E;&#x5E38;&#x306B;&#x5C0F;&#x3055;&#x3044;(1%&#x304B;&#x3089;3%)&#x3067;&#x3059;&#x3002;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306A;&#xFF13;&#x3064;&#x306E;&#x7279;&#x5FB4;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><ul><li>&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;
</li>
<li>&#x8907;&#x5408;&#x7684;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x683C;&#x7D0D;
</li>
<li>&#x62E1;&#x5F35;&#x53EF;&#x80FD;
</li></ul>
<h3 id="&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;">&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;</h3><p><strong>&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;</strong> &#x306F;JFR&#x306E;&#x6700;&#x5927;&#x306E;&#x7279;&#x5FB4;&#x3067;&#x3042;&#x308A;&#x3001;Flight Recoder&#x306E;&#x540D;&#x524D;&#x306E;&#x7531;&#x6765;&#x3067;&#x3082;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002; &#x305D;&#x3082;&#x305D;&#x3082;Flight Recorder&#x3068;&#x306F;&#x98DB;&#x884C;&#x6A5F;&#x306E;&#x969C;&#x5BB3;&#x5BFE;&#x5FDC;/&#x4E8B;&#x6545;&#x5206;&#x6790;&#x306E;&#x70BA;&#x306B;&#x751F;&#x307E;&#x308C;&#x305F;&#x4ED5;&#x7D44;&#x307F;&#x306B;&#x7531;&#x6765;&#x3057;&#x307E;&#x3059;&#x3002;</p><blockquote><p>&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x3068;&#x306F;&#x3001;&#x30D5;&#x30E9;&#x30A4;&#x30C8;&#x30C7;&#x30FC;&#x30BF;&#x30EC;&#x30B3;&#x30FC;&#x30C0;&#x30FC; (FDR) &#x3068;&#x30B3;&#x30C3;&#x30AF;&#x30D4;&#x30C3;&#x30C8;&#x30DC;&#x30A4;&#x30B9;&#x30EC;&#x30B3;&#x30FC;&#x30C0;&#x30FC; (CVR) &#x306E;&#x901A;&#x79F0;&#x3067;&#x3042;&#x308B;&#x3002;</p><p>&#x301C; &#x4E2D;&#x7565; &#x301C;</p><p>&#x4E8B;&#x6545;&#x304C;&#x767A;&#x751F;&#x3057;&#x305F;&#x969B;&#x3001;&#x4E57;&#x54E1;&#x30FB;&#x4E57;&#x5BA2;&#x304C;&#x5168;&#x54E1;&#x6B7B;&#x4EA1;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x73CD;&#x3057;&#x304F;&#x306A;&#x3044;&#x822A;&#x7A7A;&#x4E8B;&#x6545;&#x3067;&#x306F;&#x3001;&#x4E8B;&#x6545;&#x539F;&#x56E0;&#x7A76;&#x660E;&#x306E;&#x624B;&#x639B;&#x304B;&#x308A;&#x3092;&#x5F97;&#x308B;&#x3053;&#x3068;&#x304C;&#x5927;&#x5909;&#x96E3;&#x3057;&#x3044;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x98DB;&#x884C;&#x4E2D;&#x306E;&#x30B3;&#x30C3;&#x30AF;&#x30D4;&#x30C3;&#x30C8;&#x5185;&#x3067;&#x64CD;&#x7E26;&#x58EB;&#x305F;&#x3061;&#x304C;&#x4EA4;&#x308F;&#x3057;&#x305F;&#x4F1A;&#x8A71;&#x3084;&#x822A;&#x7A7A;&#x4EA4;&#x901A;&#x7BA1;&#x5236;&#x6A5F;&#x95A2;&#x3068;&#x306E;&#x4EA4;&#x4FE1;&#x5185;&#x5BB9;&#x3001;&#x6A5F;&#x4F53;&#x306E;&#x98DB;&#x884C;&#x72B6;&#x6CC1;&#x3092;&#x8A18;&#x9332;&#x3057;&#x7D9A;&#x3051;&#x308B;&#x3053;&#x3068;&#x306B;&#x3088;&#x308A;&#x3001;&#x4E8B;&#x6545;&#x539F;&#x56E0;&#x7A76;&#x660E;&#x306E;&#x305F;&#x3081;&#x306E;&#x624B;&#x639B;&#x304B;&#x308A;&#x3068;&#x3059;&#x308B;&#x3079;&#x304F;&#x65C5;&#x5BA2;&#x6A5F;&#x306B;&#x642D;&#x8F09;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;</p></blockquote><p>Ref: <a href="https://ja.wikipedia.org/wiki/%E3%83%96%E3%83%A9%E3%83%83%E3%82%AF%E3%83%9C%E3%83%83%E3%82%AF%E3%82%B9_(%E8%88%AA%E7%A9%BA" target="_blank">&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30DC;&#x30C3;&#x30AF;&#x30B9; (&#x822A;&#x7A7A;) - Wikipedia</a>)</p><p>&#x3053;&#x308C;&#x306F;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x969C;&#x5BB3;&#x3067;&#x3082;&#x5B9F;&#x306F;&#x540C;&#x3058;&#x3088;&#x3046;&#x306A;&#x554F;&#x984C;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x3067;&#x4E00;&#x756A;&#x56F0;&#x308B;&#x306E;&#x306F; <strong>&#x300C;&#x672C;&#x756A;&#x74B0;&#x5883;&#x306E;&#x307F;&#x3067;&#x4E0D;&#x5B9A;&#x671F;&#x306B;&#x767A;&#x751F;&#x3059;&#x308B;&#x969C;&#x5BB3;&#x300D;</strong> &#x3067;&#x3059;&#x3002;</p><p>&#x901A;&#x5E38;&#x76E3;&#x8996;&#x306E;&#x7BC4;&#x56F2;&#x3067;&#x3068;&#x3063;&#x3066;&#x308B;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3067;&#x5206;&#x6790;&#x3067;&#x304D;&#x308C;&#x3070;&#x307E;&#x3060;&#x826F;&#x3044;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x305D;&#x3046;&#x3067;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x76E3;&#x8996;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x5909;&#x3048;&#x305F;&#x308A;&#x30A2;&#x30D7;&#x30EA;&#x3084;&#x30DF;&#x30C9;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x306E;&#x30ED;&#x30B0;&#x3092;&#x8FFD;&#x52A0;&#x3057;&#x3066; <strong>&#x300C;&#x969C;&#x5BB3;&#x306E;&#x518D;&#x767A;&#x3092;&#x5F85;&#x3064;&#x300D;</strong>&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x3042;&#x308B;&#x3044;&#x306F;&#x969C;&#x5BB3;&#x6642;&#x306B;&#x305D;&#x306E;&#x77AC;&#x9593;&#x306E;&#x8A73;&#x7D30;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x6253;&#x3064;&#x3068;&#x3044;&#x3046;&#x4F5C;&#x696D;&#x3082;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x3063;&#x3066;&#x304F;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;</p><p>&#x3053;&#x3046;&#x3057;&#x3066;&#x5F97;&#x305F;&#x60C5;&#x5831;&#x3092;&#x5143;&#x306B;&#x4EEE;&#x8AAC;&#x3092;&#x7ACB;&#x3066;&#x3001;&#x30C6;&#x30B9;&#x30C8;&#x74B0;&#x5883;&#x3067;&#x554F;&#x984C;&#x3092;&#x518D;&#x73FE;&#x3055;&#x305B;&#x3001;&#x30D0;&#x30B0;&#x3092;&#x4FEE;&#x6B63;&#x3057;&#x3001;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x3057;&#x3066;&#x3001;&#x30D0;&#x30B0;&#x304C;&#x518D;&#x73FE;&#x3057;&#x306A;&#x3044;&#x3053;&#x3068;&#x3092;&#x78BA;&#x8A8D;&#x3059;&#x308B;&#x307E;&#x3067;&#x304C;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x611F;&#x899A;&#x7684;&#x306B;&#x306F;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x306E;&#x30BF;&#x30B9;&#x30AF;&#x306E;8&#x5272;&#x304F;&#x3089;&#x3044;&#x306F;&#x539F;&#x56E0;&#x306E;&#x7A76;&#x660E;&#x3067;&#x3059;&#x3002;&#x30D0;&#x30B0;&#x4FEE;&#x6B63;&#x3068;&#x304B;&#x306F;&#x305D;&#x308C;&#x306B;&#x6BD4;&#x3079;&#x308C;&#x3070;&#x5C0F;&#x3055;&#x306A;&#x5272;&#x5408;&#x3067;&#x3059;&#x3002;&#x305D;&#x3057;&#x3066;&#x539F;&#x56E0;&#x7A76;&#x660E;&#x3068;&#x3044;&#x3046;&#x63A8;&#x7406;&#x30B2;&#x30FC;&#x30E0;&#x306F;&#x30D2;&#x30F3;&#x30C8;&#x3068;&#x306A;&#x308B;&#x624B;&#x639B;&#x304B;&#x308A;&#x304C;&#x304C;&#x5FC5;&#x8981;&#x306B;&#x306A;&#x3063;&#x3066;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x306A;&#x306E;&#x3067;&#x3001;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x306B;&#x5927;&#x91CF;&#x306E;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x53CE;&#x96C6;&#x3057;&#x3066;&#x3044;&#x308B;JFR&#x306F;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x306E;&#x5F37;&#x3044;&#x5473;&#x65B9;&#x306B;&#x306A;&#x308B;&#x306E;&#x3067;&#x3059;&#x3002;</p><p>JVM&#x306B;&#x7D44;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x70BA;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x306E;&#x5C0F;&#x3055;&#x3044;JFR&#x306F; <strong>&#x300C;&#x672C;&#x756A;&#x7A3C;&#x50CD;&#x4E2D;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x5E38;&#x6642;&#x9069;&#x7528;&#x53EF;&#x80FD;&#x300D;</strong>&#x3067;&#x3059;&#x3002;&#x305D;&#x308C;&#x3067;&#x3044;&#x3066;CPU&#x3084;&#x30E1;&#x30E2;&#x30EA;(Heap/Metaspace/OS&#x30E1;&#x30E2;&#x30EA;)&#x3001;GC&#x30ED;&#x30B0;&#x306F;&#x3082;&#x3061;&#x308D;&#x3093;&#x3067;&#x3059;&#x304C;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;I/O&#x3084;&#x30C7;&#x30A3;&#x30B9;&#x30AF;I/O&#x305D;&#x3057;&#x3066;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x3068;&#x304B;&#x306A;&#x308A;&#x5927;&#x91CF;&#x306E;&#x60C5;&#x5831;&#x96C6;&#x3081;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x7D42;&#x4E86;&#x6642;&#x306A;&#x3069;&#x306E;&#x7570;&#x5E38;&#x52D5;&#x4F5C;&#x6642;&#x306B;&#x306F;&#x30E1;&#x30E2;&#x30EA;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306B;&#x66F8;&#x304D;&#x8FBC;&#x3093;&#x3067;&#x3044;&#x305F;&#x30ED;&#x30B0;&#x60C5;&#x5831;&#x3082;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x30D5;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3059;&#x308B;&#x3068;&#x3044;&#x3046;&#x7279;&#x5FB4;&#x3082;&#x6301;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x3053;&#x308C;&#x3089;&#x306E;&#x7279;&#x5FB4;&#x306F;&#x5927;&#x91CF;&#x306E;&#x60C5;&#x5831;&#x304B;&#x3089;&#x7D20;&#x65E9;&#x304F;&#x539F;&#x56E0;&#x7A76;&#x660E;&#x304C;&#x51FA;&#x6765;&#x308B;&#x3060;&#x3051;&#x3067;&#x306F;&#x306A;&#x304F; <strong>&#x300C;&#x969C;&#x5BB3;&#x306E;&#x518D;&#x767A;&#x3092;&#x5F85;&#x3064;(=&#x5C11;&#x306A;&#x304F;&#x3068;&#x3082;&#x3082;&#x3046;&#x4E00;&#x5EA6;&#x969C;&#x5BB3;&#x304C;&#x8D77;&#x3053;&#x308B;)&#x300D;</strong> <strong>&#x300C;&#x7570;&#x5E38;&#x52D5;&#x4F5C;&#x6642;&#x306B;&#x8A73;&#x7D30;&#x30ED;&#x30B0;&#x3092;&#x53D6;&#x308B;(=&#x969C;&#x5BB3;&#x5FA9;&#x65E7;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x6642;&#x9593;&#x304C;&#x4F38;&#x3073;&#x308B;)&#x300D;</strong> &#x3068;&#x3044;&#x3063;&#x305F;&#x884C;&#x70BA;&#x304C;&#x7121;&#x304F;&#x306A;&#x308B;&#x306E;&#x3067;&#x975E;&#x5E38;&#x306B;&#x30D3;&#x30B8;&#x30CD;&#x30B9;&#x7684;&#x306B;&#x3082;&#x6709;&#x7528;&#x306A;&#x52B9;&#x679C;&#x3092;&#x3082;&#x305F;&#x3089;&#x3057;&#x307E;&#x3059;&#x3002;</p><p><strong>&#x56F3;: &#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;&#x306B;&#x3088;&#x308B;&#x969C;&#x5BB3;&#x5206;&#x6790;&#x6642;&#x9593;&#x306E;&#x77ED;&#x7E2E;</strong></p><p><img alt="JFR&#x306B;&#x3088;&#x308B;&#x969C;&#x5BB3;&#x5206;&#x6790;&#x6642;&#x9593;&#x306E;&#x77ED;&#x7E2E;" src="../images/01-01-blackbox_analysis.svg"></p><p>&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;<strong>&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30FB;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;</strong>&#x3092;&#x5B9F;&#x73FE;&#x3059;&#x308B;&#x306E;&#x304C;JFR&#x3067;&#x3059;&#x3002;</p><h3 id="&#x8907;&#x5408;&#x7684;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x683C;&#x7D0D;">&#x8907;&#x5408;&#x7684;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x683C;&#x7D0D;</h3><p>&#x30D6;&#x30E9;&#x30C3;&#x30AF;&#x30DC;&#x30C3;&#x30AF;&#x30B9;&#x5206;&#x6790;&#x306E;&#x4E00;&#x90E8;&#x3068;&#x3082;&#x8A00;&#x3048;&#x307E;&#x3059;&#x304C;JFR&#x306E;&#x7279;&#x5FB4;&#x3068;&#x3057;&#x3066; <strong>&#x300C;&#xFF11;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x8907;&#x5408;&#x7684;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x683C;&#x7D0D;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x300D;</strong> &#x3068;&#x3044;&#x3046;&#x70B9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>Java&#x306B;&#x306F;GC&#x30ED;&#x30B0;&#x3092;&#x53D6;&#x308B;&#x4ED5;&#x7D44;&#x307F;&#x3084;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x53D6;&#x308B;&#x4ED5;&#x7D44;&#x307F;&#x3042;&#x304C;&#x308A;&#x3001;&#x53E4;&#x304F;&#x304B;&#x3089;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x306E;&#x65B9;&#x6CD5;&#x3068;&#x3057;&#x3066;&#x5229;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x7279;&#x306B;GC&#x30ED;&#x30B0;&#x306F;&#x5E38;&#x6642;&#x53D6;&#x308B;&#x306E;&#x304C;&#x30D9;&#x30B9;&#x30C8;&#x30D7;&#x30E9;&#x30AF;&#x30C6;&#x30A3;&#x30B9;&#x3068;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;OS&#x306E;CPU&#x3084;I/O Wait&#x3082;Zabbix&#x306E;&#x3088;&#x3046;&#x306A;&#x7D71;&#x5408;&#x76E3;&#x8996;&#x30C4;&#x30FC;&#x30EB;&#x3084;Linux&#x306E;Sysstat(sar))&#x3067;&#x904E;&#x53BB;&#x306E;&#x60C5;&#x5831;&#x3092;&#x542B;&#x3081;&#x3066;&#x8A18;&#x9332;&#x3059;&#x308B;&#x306E;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3067;&#x3059;&#x3002;</p><p>&#x305D;&#x306E;&#x4ED6;&#x306B;&#x3082;Tomcat, GlassFish&#x306E;&#x3088;&#x3046;&#x306A;&#x30DF;&#x30C9;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x306E;&#x30ED;&#x30B0;&#x3084;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x30ED;&#x30B0;&#x306B;&#x3082;&#x69D8;&#x3005;&#x306A;&#x60C5;&#x5831;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x307E;&#x3059;&#x3002;&#x30A8;&#x30E9;&#x30FC;&#x6642;&#x306B;&#x306F;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x306E;&#x60C5;&#x5831;&#x3082;&#x5F53;&#x7136;&#x51FA;&#x529B;&#x3057;&#x3066;&#x308B;&#x3067;&#x3057;&#x3087;&#x3046;&#x3057;&#x3002;</p><p>&#x4EE5;&#x524D;&#x306F;&#x3001;&#x3053;&#x3046;&#x3057;&#x305F;&#x69D8;&#x3005;&#x306A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3057;&#x3001;awk&#x3067;&#x52A0;&#x5DE5;&#x3042;&#x308B;&#x3044;&#x306F;Excel&#x3067;&#x6642;&#x7CFB;&#x5217;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x30B5;&#x30DE;&#x30EA;&#x3092;&#x30D3;&#x30B8;&#x30E5;&#x30A2;&#x30E9;&#x30A4;&#x30BA;&#x3001;&#x3068;&#x3044;&#x3046;&#x4E8B;&#x3092;&#x3057;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;&#x3064;&#x307E;&#x308A;&#x3001;&#x6563;&#x3089;&#x3070;&#x3063;&#x305F;&#x6709;&#x7528;&#x306A;&#x60C5;&#x5831;&#x3092;&#x304B;&#x304D;&#x96C6;&#x3081;&#x308B;&#x4E8B;&#x304B;&#x3089;&#x59CB;&#x3081;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x3063;&#x305F;&#x308F;&#x3051;&#x3067;&#x3059;&#x3002;</p><p>&#x4E00;&#x65B9;&#x3001;JFR&#x306F;&#x524D;&#x8FF0;&#x3057;&#x305F;&#x3088;&#x3046;&#x306A;&#x8907;&#x6570;&#x306E;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x5358;&#x4E00;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x51FA;&#x529B;&#x3057;&#x307E;&#x3059;&#x3002;&#x307E;&#x305F;&#x3001;Weblogic&#x306E;&#x3088;&#x3046;&#x306A;&#x4E00;&#x90E8;&#x306E;&#x30DF;&#x30C9;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x306F;&#x8A3A;&#x65AD;&#x30ED;&#x30B0;&#x3092;JFR&#x306B;&#x66F8;&#x304D;&#x8FBC;&#x3080;&#x6A5F;&#x80FD;&#x3092;&#x5099;&#x3048;&#x3066;&#x304A;&#x308A;JFR&#x3060;&#x3051;&#x3092;&#x898B;&#x308C;&#x3070;OS,JVM, &#x30DF;&#x30C9;&#x30EB;&#x30A6;&#x30A7;&#x30A2;&#x3068;&#x3044;&#x3063;&#x305F;&#x69D8;&#x3005;&#x306A;&#x30ED;&#x30B0;&#x3092;&#x4E00;&#x62EC;&#x3057;&#x3066;&#x898B;&#x308C;&#x308B;&#x3068;&#x3044;&#x3046;&#x7279;&#x5FB4;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x4E0B;&#x8A18;&#x306E;&#x56F3;&#x306E;&#x3088;&#x3046;&#x306B;&#x5F93;&#x6765;&#x306E;&#x30ED;&#x30B0;&#x3060;&#x3068;&#x8ABF;&#x67FB;&#x3092;&#x3057;&#x306A;&#x304C;&#x3089;&#x3064;&#x3069;&#x3064;&#x3069;&#x30ED;&#x30B0;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4E00;&#x65B9;&#x3001;JFR&#x306B;&#x306F;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x304C;&#xFF11;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x96C6;&#x7D04;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x4E00;&#x5EA6;&#x306E;&#x53D6;&#x5F97;&#x3067;&#x6E08;&#x307F;&#x307E;&#x3059;&#x3002;</p><p>&#x3053;&#x308C;&#x306F;&#x81EA;&#x5206;&#x3067;&#x5206;&#x6790;&#x3059;&#x308B;&#x306B;&#x3057;&#x308D;&#x3001;&#x5546;&#x7528;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x6295;&#x3052;&#x308B;&#x306B;&#x3057;&#x308D;&#x3068;&#x3066;&#x3082;&#x52B9;&#x7387;&#x7684;&#x3067;&#x3059;&#x3002;&#x7279;&#x306B;&#x3001;&#x30ED;&#x30B0;&#x306E;&#x53D6;&#x5F97;&#x3092;&#x4F9D;&#x983C;&#x30D9;&#x30FC;&#x30B9;&#x3067;&#x5B9F;&#x65BD;&#x3057;&#x306A;&#x3044;&#x3068;&#x3044;&#x3051;&#x306A;&#x3044;&#x6642;&#x306B;&#x306F;&#x5927;&#x304D;&#x306A;&#x6642;&#x9593;&#x77ED;&#x7E2E;&#x306B;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p><p><strong>&#x56F3;: JFR&#x306B;&#x3088;&#x308B;&#x30C7;&#x30FC;&#x30BF;&#x53D6;&#x5F97;&#x624B;&#x7D9A;&#x304D;&#x306E;&#x7701;&#x7565;</strong>
<img alt="JFR&#x306B;&#x3088;&#x308B;&#x30C7;&#x30FC;&#x30BF;&#x53D6;&#x5F97;&#x624B;&#x7D9A;&#x304D;&#x306E;&#x7701;&#x7565;_Before" src="../images/01-01-analysis_flow.svg"></p><p>&#x307E;&#x305F;&#x3001;JDK Mission Control(JMC)&#x3068;&#x3044;&#x3046;&#x30D3;&#x30B8;&#x30E5;&#x30A2;&#x30EB;&#x5206;&#x6790;&#x30C4;&#x30FC;&#x30EB;&#x3082;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001;JMC&#x3068;JFR&#x3092;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x308B;&#x4E8B;&#x3067;&#x52B9;&#x7387;&#x7684;&#x306A;&#x5206;&#x6790;&#x3092;&#x5B9F;&#x73FE;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><h3 id="&#x62E1;&#x5F35;&#x53EF;&#x80FD;">&#x62E1;&#x5F35;&#x53EF;&#x80FD;</h3><p>&#x6700;&#x5F8C;&#x306B;JFR&#x306F; <strong>&#x300C;&#x62E1;&#x5F35;&#x53EF;&#x80FD;&#x300D;</strong>&#x3068;&#x3044;&#x3046;&#x7279;&#x5FB4;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>JFR&#x306F;&#x6A19;&#x6E96;&#x6A5F;&#x80FD;&#x3068;&#x3057;&#x3066;JVM&#x304B;&#x3089;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x69D8;&#x3005;&#x306A;&#x60C5;&#x5831;&#x3092;&#x683C;&#x7D0D;&#x3057;&#x307E;&#x3059;&#x304C;&#x3001;JFR API&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3092;&#x4F5C;&#x308B;&#x3053;&#x3068;&#x3067;&#x597D;&#x304D;&#x306A;&#x5024;&#x3092;&#x683C;&#x7D0D;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p><p>&#x524D;&#x8FF0;&#x3057;&#x305F;Weblogic&#x3082;&#x30AB;&#x30B9;&#x30BF;&#x30E0;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x3092;&#x4F7F;&#x3063;&#x3066;Weblogic&#x304C;&#x5143;&#x3005;&#x6301;&#x3064;WLDF&#x3068;&#x547C;&#x3070;&#x308C;&#x308B;&#x8A3A;&#x65AD;&#x30ED;&#x30B0;&#x3092;JFR&#x306B;&#x66F8;&#x304D;&#x8FBC;&#x3093;&#x3067;&#x3044;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x306B;&#x3088;&#x308A;&#x30E1;&#x30BD;&#x30C3;&#x30C9;&#x306E;&#x5206;&#x6563;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x3084;&#x5B9F;&#x884C;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;SQL&#x30AF;&#x30A8;&#x30EA;&#x306E;&#x5206;&#x6790;&#x306A;&#x3069;&#x3082;&#x53EF;&#x80FD;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x62E1;&#x5F35;&#x306F;JFR API&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3067;&#x8AB0;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;&#x305D;&#x306E;&#x70BA;&#x3001;GlassFish&#x3084;Tomcat&#x3067;&#x3082;Weblogic&#x3068;&#x540C;&#x3058;&#x3088;&#x3046;&#x306B;JFR&#x306B;&#x30ED;&#x30B0;&#x3092;&#x66F8;&#x304F;&#x3053;&#x3068;&#x306F;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3057;&#x3001;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3084;&#x81EA;&#x5206;&#x305F;&#x3061;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x305D;&#x306E;&#x3082;&#x306E;&#x306E;&#x30ED;&#x30B0;&#x3092;JFR&#x306B;&#x66F8;&#x304F;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p><p>&#x3053;&#x3046;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001;JFR&#x306B;&#x5FC5;&#x8981;&#x306A;&#x60C5;&#x5831;&#x304C;&#x96C6;&#x7D04;&#x3055;&#x308C;&#x3001;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C8;&#x3067;&#x8907;&#x6570;&#x306E;&#x30ED;&#x30B0;&#x306E;&#x7A81;&#x304D;&#x5408;&#x308F;&#x305B;&#x308B;&#x5FC5;&#x8981;&#x3082;&#x7121;&#x304F;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x30AB;&#x30B9;&#x30BF;&#x30E0;API&#x306B;&#x95A2;&#x3057;&#x3066;&#x306F;&#x5143;&#x3005;&#x975E;&#x516C;&#x5F0F;&#x7248;&#x3068;&#x3057;&#x3066;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x305F;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x975E;&#x516C;&#x5F0F;&#x306A;&#x306E;&#x3067;Weblogic&#x304F;&#x3089;&#x3044;&#x3057;&#x304B;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x306A;&#x3044;&#x72B6;&#x614B;&#x304C;&#x7D9A;&#x3044;&#x3066;&#x3044;&#x307E;&#x3057;&#x305F;&#x3002;
JDK9&#x3088;&#x308A;<code>jdk.jfr.*</code>&#x304C;JFR API&#x3068;&#x3057;&#x3066;&#x516C;&#x5F0F;&#x306B;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3055;&#x308C;&#x305F;&#x3053;&#x3068;&#x3067;&#x3001;&#x4ECA;&#x5F8C;&#x306F;&#x6D3B;&#x7528;&#x304C;&#x5145;&#x5B9F;&#x3057;&#x3066;&#x3044;&#x304F;&#x3068;&#x601D;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p><p><strong>&#x56F3;: JFR&#x306E;&#x62E1;&#x5F35;</strong></p><p><img alt="JFR&#x306B;&#x3088;&#x308B;&#x969C;&#x5BB3;&#x5206;&#x6790;&#x6642;&#x9593;&#x306E;&#x77ED;&#x7E2E;" src="../images/01-01-jfr_extensibility.svg"></p><p>JDK JFR API&#x306B;&#x3088;&#x308A;&#x81EA;&#x5206;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x5143;&#x3088;&#x308A;&#x3001;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3084;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x306E;&#x30ED;&#x30B0;&#x3082;&#x96C6;&#x7D04;&#x3067;&#x304D;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x51FA;&#x3066;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;Consume API&#x3092;&#x6D3B;&#x7528;&#x3059;&#x308B;&#x4E8B;&#x3067;JMC/VisualVM&#x3068;&#x3044;&#x3063;&#x305F;&#x516C;&#x5F0F;&#x30C4;&#x30FC;&#x30EB;&#x4EE5;&#x5916;&#x3067;&#x3082;JFR&#x306E;&#x5206;&#x6790;&#x3092;&#x884C;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;&#x3053;&#x306E;&#x8FBA;&#x308A;&#x306B;&#x95A2;&#x3057;&#x3066;&#x306F;6&#x7AE0;&#x3084;7&#x7AE0;&#x3067;&#x8A71;&#x3057;&#x307E;&#x3059;&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="02-other_tools.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 1.2 Javaにおけるパフォーマンス分析と障害診断">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.1 JDK Flight Recorder","level":"1.3.1","depth":2,"next":{"title":"1.2 Javaにおけるパフォーマンス分析と障害診断","level":"1.3.2","depth":2,"path":"01/02-other_tools.md","ref":"01/02-other_tools.md","articles":[]},"previous":{"title":"1章　JDK Flight Recoder とは？","level":"1.3","depth":1,"ref":"","articles":[{"title":"1.1 JDK Flight Recorder","level":"1.3.1","depth":2,"path":"01/01-what_is_JFR.md","ref":"01/01-what_is_JFR.md","articles":[]},{"title":"1.2 Javaにおけるパフォーマンス分析と障害診断","level":"1.3.2","depth":2,"path":"01/02-other_tools.md","ref":"01/02-other_tools.md","articles":[]},{"title":"1.3 JFRの歴史 - JRockitからOpenJDKまで","level":"1.3.3","depth":2,"path":"01/03-history_of_jfr.md","ref":"01/03-history_of_jfr.md","articles":[]},{"title":"1.4 JFRの動作環境とJMCのインストール","level":"1.3.4","depth":2,"path":"01/04-install_jmc.md","ref":"01/04-install_jmc.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"入門: JDK Flight Recoder","gitbook":"*"},"file":{"path":"01/01-what_is_JFR.md","mtime":"2020-06-15T23:27:20.237Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2020-06-15T23:27:38.229Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

