
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <title>1.2 Javaにおけるパフォーマンス分析と障害診断 · GitBook</title>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.0">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="01-what_is_JFR.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    目次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../preface.html">
            
                <a href="../preface.html">
            
                    
                    はじめに
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    1章　JDK Flight Recoder とは？
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="01-what_is_JFR.html">
            
                <a href="01-what_is_JFR.html">
            
                    
                    1.1 JDK Flight Recorder
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="02-other-tools.html">
            
                <a href="02-other-tools.html">
            
                    
                    1.2 Javaにおけるパフォーマンス分析と障害診断
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    2章　JDK Flight Recorderのアーキテクチャ
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../02/01-jfr-architecture.html">
            
                <a href="../02/01-jfr-architecture.html">
            
                    
                    2.2 JFR アーキテクチャ概要
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.2 Javaにおけるパフォーマンス分析と障害診断</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="12-java&#x306B;&#x304A;&#x3051;&#x308B;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;&#x3068;&#x969C;&#x5BB3;&#x8A3A;&#x65AD;">1.2 Java&#x306B;&#x304A;&#x3051;&#x308B;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;&#x3068;&#x969C;&#x5BB3;&#x8A3A;&#x65AD;</h1><p>Oracle JDK&#x3092;&#x542B;&#x3080;OpenJDK&#x30C7;&#x30A3;&#x30B9;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30B7;&#x30E7;&#x30F3;(&#x4EE5;&#x4E0B;&#x3001;Java&#x307E;&#x305F;&#x306F;JDK)&#x306B;&#x306F;JFR&#x4EE5;&#x5916;&#x306B;&#x3082;&#x69D8;&#x3005;&#x306A;&#x5206;&#x6790;&#x7528;&#x306E;&#x65B9;&#x6CD5;/&#x30C4;&#x30FC;&#x30EB;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x672C;&#x7AE0;&#x3067;&#x306F;Java&#x306B;&#x304A;&#x3051;&#x308B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x53D6;&#x5F97;&#x306E;&#x30A2;&#x30D7;&#x30ED;&#x30FC;&#x30C1;&#x3092;&#x7D39;&#x4ECB;&#x3057;&#x3066;&#x3044;&#x304D;&#x307E;&#x3059;&#x3002;</p><h2 id="&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;&#x306E;&#x57FA;&#x672C;">&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x5206;&#x6790;&#x306E;&#x57FA;&#x672C;</h2><p>Java&#x306B;&#x306F;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x65B9;&#x6CD5;&#x304C;&#x3044;&#x304F;&#x3064;&#x304B;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;&#x4EE3;&#x8868;&#x7684;&#x306A;&#x306E;&#x306F;&#x4E0B;&#x8A18;&#x306E;3&#x3064;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</p><ul><li>JMX
</li>
<li>&#x30ED;&#x30B0;
</li>
<li>JPLIS(javaagent)
</li></ul>
<h3 id="jmx">JMX</h3><p>Java Management Extensions(JMX)&#x306F;Java&#x306E;&#x30EA;&#x30BD;&#x30FC;&#x30B9;&#x76E3;&#x8996;&#x304A;&#x3088;&#x3073;&#x7BA1;&#x7406;&#x306E;&#x305F;&#x3081;&#x306E;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x3067;&#x3059;&#x3002;&#x7C21;&#x5358;&#x306B;&#x3044;&#x3048;&#x3070;Java&#x7248;&#x306E;SNMP&#x3067;&#x3059;&#x3002;
JSR-174&#x3068;&#x3057;&#x3066;Java 1.5&#x3088;&#x308A;&#x53D6;&#x308A;&#x8FBC;&#x307E;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>Managed Bean(MBean)&#x3092;&#x5229;&#x7528;&#x3057;&#x3066;CPU&#x3084;&#x30E1;&#x30E2;&#x30EA;&#x306E;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3057;&#x305F;&#x308A;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x30A4;&#x30D9;&#x30F3;&#x30C8;(&#x4F8B;&#x3048;&#x3070;&#x5F37;&#x5236;GC)&#x3068;&#x304B;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p><p>MBean&#x3092;&#x81EA;&#x524D;&#x3067;&#x5B9A;&#x7FA9;&#x3059;&#x308B;&#x4E8B;&#x3082;&#x3067;&#x304D;&#x3001;&#x5143;&#x3005;JavaEE&#x304B;&#x3089;&#x59CB;&#x307E;&#x3063;&#x305F;&#x6280;&#x8853;&#x3068;&#x3044;&#x3046;&#x4E8B;&#x3082;&#x3042;&#x3063;&#x3066;Weblogic&#x3084;GlassFish&#x3068;&#x8A00;&#x3063;&#x305F;&#x591A;&#x304F;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30B3;&#x30F3;&#x30C6;&#x30CA;&#x304C;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x6570;&#x3084;&#x5F85;&#x6A5F;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x6570;&#x306A;&#x3069;&#x69D8;&#x3005;&#x306A;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x3092;JMX&#x3067;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;Java&#x88FD;&#x306E;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x76E3;&#x8996;&#x3059;&#x308B;&#x3068;&#x304D;&#x306E;&#x6700;&#x3082;&#x57FA;&#x672C;&#x7684;&#x306A;&#x9078;&#x629E;&#x80A2;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x305F;&#x3060;&#x3057;&#x3001;&#x8FD1;&#x5E74;&#x3067;&#x306F;&#x72EC;&#x81EA;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306F;&#x76E3;&#x8996;&#x30C4;&#x30FC;&#x30EB;&#x5074;&#x3068;&#x306E;&#x9023;&#x643A;&#x304C;&#x3057;&#x3065;&#x3089;&#x3044;&#x3068;&#x8A00;&#x3046;&#x70B9;&#x304B;&#x3089;JMX&#x3092;HTTP&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x5909;&#x63DB;&#x3059;&#x308B;OSS&#x306E;Jolokia&#x3084;&#x3001;JMX&#x306B;&#x4EE3;&#x308F;&#x308B;&#x65B0;&#x3057;&#x3044;&#x30E1;&#x30C8;&#x30EA;&#x30AF;&#x30B9;&#x53D6;&#x5F97;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30FC;&#x30B9;&#x3067;&#x3042;&#x308B;Eclipse Microprofile Metrics&#x306A;&#x3069;&#x304C;&#x767B;&#x5834;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><h3 id="&#x30ED;&#x30B0;">&#x30ED;&#x30B0;</h3><p>Java&#x3067;&#x306F;GC&#x306A;&#x3069;&#x306E;&#x8A73;&#x7D30;&#x306A;&#x30ED;&#x30B0;&#x3092;JVM&#x3088;&#x308A;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x5143;&#x3005;&#x3001;Java&#x306F;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x30A2;&#x30C3;&#x30D7;&#x3068;&#x5171;&#x306B;&#x69D8;&#x3005;&#x306A;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30ED;&#x30B0;&#x304C;&#x53D6;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x9032;&#x5316;&#x3057;&#x3066;&#x304D;&#x305F;&#x306E;&#x3067;&#x3059;&#x304C;&#x3001;&#x4E00;&#x8CAB;&#x6027;&#x304C;&#x306A;&#x304F;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30ED;&#x30B0;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30C3;&#x30C8;&#x3084;&#x8A2D;&#x5B9A;&#x65B9;&#x6CD5;&#x3092;&#x899A;&#x3048;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3057;&#x305F;&#x3002;</p><p>&#x3057;&#x304B;&#x3057;&#x3001;Java 9&#x3088;&#x308A;Unified JVM Logging&#x3068;&#x3057;&#x3066;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30ED;&#x30B0;&#x306B;&#x95A2;&#x3059;&#x308B;&#x4ED5;&#x69D8;&#x304C;&#x7D71;&#x5408;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x7D50;&#x679C;&#x3068;&#x3057;&#x3066;&#x3001;&#x5229;&#x4FBF;&#x6027;&#x306F;&#x4E0A;&#x304C;&#x3063;&#x305F;&#x306E;&#x3067;&#x3059;&#x304C;Java 8&#x306E;&#x9803;&#x3068;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x7B49;&#x304C;&#x9055;&#x3046;&#x306E;&#x3067;&#x53E4;&#x3044;&#x30C9;&#x30AD;&#x30E5;&#x30E1;&#x30F3;&#x30C8;&#x3092;&#x898B;&#x305F;&#x308A;&#x3059;&#x308B;&#x6642;&#x306F;&#x6CE8;&#x610F;&#x3057;&#x3066;&#x304F;&#x3060;&#x3055;&#x3044;&#x3002;</p><p>&#x4F8B;&#x3048;&#x3070;GC&#x30ED;&#x30B0;&#x306A;&#x3089;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;JVM&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x30ED;&#x30B0;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x307E;&#x3059;&#x3002;</p><pre><code class="lang-bash">-X<span class="hljs-built_in">log</span>:gc*=debug:/path/to/gc_%p_%t.log:time,level,tags:filesize=100m,filecount=7</code></pre>
<p>&#x307E;&#x305F;&#x3001;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x30ED;&#x30B0;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5B9A;&#x671F;&#x7684;&#x306B;&#x51FA;&#x3057;&#x305F;&#x3044;&#x3068;&#x8A00;&#x3046;&#x30CB;&#x30FC;&#x30BA;&#x3082;&#x3042;&#x308B;&#x304B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x3053;&#x308C;&#x306F;JVM&#x306E;&#x30ED;&#x30B0;&#x6A5F;&#x80FD;&#x3067;&#x306F;&#x3067;&#x304D;&#x307E;&#x305B;&#x3093;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x5F8C;&#x8FF0;&#x3059;&#x308B;<code>jstack</code>&#x3084;<code>jcmd</code>&#x3001;&#x3042;&#x308B;&#x3044;&#x306F;<code>kill -3</code>&#x3092;&#x5B9A;&#x671F;&#x7684;&#x306B;&#x5B9F;&#x884C;&#x3057;&#x3066;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x66F8;&#x304D;&#x8FBC;&#x3080;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F5C;&#x308B;&#x306E;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3067;&#x3057;&#x305F;&#x3002;</p><p>&#x305F;&#x3060;&#x3001;JFR&#x3092;&#x4F7F;&#x3046;&#x306A;&#x3089;JFR&#x5074;&#x306B;&#x30B9;&#x30BF;&#x30C3;&#x30AF;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x305D;&#x3061;&#x3089;&#x3067;&#x5341;&#x5206;&#x3067;&#x3057;&#x3087;&#x3046;&#x3002;</p><h3 id="jplisjavaagent">JPLIS(javaagent)</h3><p>Java Programming Language Instrumentation Services(JPLIS)&#x306F;<code>java.lang.instrument</code>&#x3068;&#x8A00;&#x3046;&#x3001;&#x3042;&#x307E;&#x308A;&#x805E;&#x304D;&#x6163;&#x308C;&#x306A;&#x3044;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x9023;&#x643A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30A4;&#x30F3;&#x30BF;&#x30FC;&#x30D5;&#x30A7;&#x30FC;&#x30B9;&#x3067;&#x3059;&#x3002;<code>javaagent</code>&#x3092;JMV&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x3057;&#x3066;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x4E8B;&#x3067;&#x5229;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;</p><p>&#x3053;&#x308C;&#x306F;JVM&#x304C;&#x30AF;&#x30E9;&#x30B9;&#x3092;&#x30ED;&#x30FC;&#x30C9;&#x3059;&#x308B;&#x30BF;&#x30A4;&#x30DF;&#x30F3;&#x30B0;&#x3067;&#x30A8;&#x30FC;&#x30B8;&#x30A7;&#x30F3;&#x30C8;&#x304C;&#x30AF;&#x30E9;&#x30B9;&#x306E;&#x60C5;&#x5831;&#x3092;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x308B;API&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;&#x3053;&#x308C;&#x3092;&#x4F7F;&#x3063;&#x3066;Java&#x306E;&#x30AA;&#x30D6;&#x30B8;&#x30A7;&#x30AF;&#x30C8;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3057;&#x305F;&#x308A;&#x3001;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x7528;&#x306E;&#x30A2;&#x30B9;&#x30DA;&#x30AF;&#x30C8;&#x3092;&#x57CB;&#x3081;&#x8FBC;&#x3093;&#x3067;&#x30C8;&#x30EC;&#x30FC;&#x30B9;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x306A;&#x3069;&#x306E;&#x4F7F;&#x3044;&#x65B9;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x8CC7;&#x6599;&#x304C;&#x5C11;&#x306A;&#x3044;&#x306E;&#x304C;&#x96E3;&#x70B9;&#x3067;&#x3059;&#x304C;AspectJ&#x306A;&#x3069;&#x3068;&#x7D44;&#x307F;&#x5408;&#x308F;&#x305B;&#x308B;&#x3068;&#x6BD4;&#x8F03;&#x7684;&#x7C21;&#x5358;&#x306B;&#x5229;&#x7528;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x539F;&#x7406;&#x4E0A;&#x307B;&#x307C;&#x3069;&#x3093;&#x306A;&#x5024;&#x3067;&#x3082;&#x53D6;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001;&#x591A;&#x304F;&#x306E;APM&#x306F;&#x3053;&#x306E;Java&#x30A8;&#x30FC;&#x30B8;&#x30A7;&#x30F3;&#x30C8;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x5B9F;&#x88C5;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;&#x305F;&#x3060;&#x3057;&#x30D0;&#x30A4;&#x30C8;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x308B;&#x7279;&#x6027;&#x4E0A;&#x3001;&#x5E83;&#x7BC4;&#x56F2;&#x306B;&#x539F;&#x56E0;&#x7279;&#x5B9A;&#x306E;&#x3057;&#x96E3;&#x3044;&#x30D0;&#x30B0;&#x3092;&#x767A;&#x751F;&#x3055;&#x305B;&#x308B;&#x30EA;&#x30B9;&#x30AF;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001;&#x30C6;&#x30B9;&#x30C8;/&#x30C7;&#x30D0;&#x30C3;&#x30AF;&#x306F;&#x5165;&#x5FF5;&#x306B;&#x884C;&#x3063;&#x3066;&#x5229;&#x7528;&#x3057;&#x307E;&#x3057;&#x3087;&#x3046;&#x3002;</p><h2 id="jdk&#x6A19;&#x6E96;&#x30C4;&#x30FC;&#x30EB;">JDK&#x6A19;&#x6E96;&#x30C4;&#x30FC;&#x30EB;</h2><p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x542B;&#x307E;&#x308C;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x3082;&#x591A;&#x304F;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><h3 id="jconsole">JConsole</h3><p>JMX&#x3092;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;&#x304B;&#x306A;&#x308A;&#x6614;&#x304B;&#x3089;&#x3042;&#x308B;&#x306E;&#x3067;&#x53E4;&#x3044;&#x66F8;&#x7C4D;&#x3084;Web&#x30B5;&#x30A4;&#x30C8;&#x3067;&#x3082;&#x6027;&#x80FD;&#x8A66;&#x9A13;&#x306B;&#x5229;&#x7528;&#x3059;&#x308B;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x3057;&#x3066;&#x7D39;&#x4ECB;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x308A;&#x3057;&#x307E;&#x3059;&#x3002;</p><p>JMX&#x306F;Java&#x7248;SNMP&#x3068;&#x8A00;&#x3063;&#x305F;&#x4ED5;&#x69D8;&#x3067;CPU, &#x30D2;&#x30FC;&#x30D7;, GC, &#x30ED;&#x30FC;&#x30C9;&#x30AF;&#x30E9;&#x30B9;&#x6570;&#x7B49;&#x306E;&#x60C5;&#x5831;&#x304C;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;&#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x306A;UI&#x306E;&#x826F;&#x3044;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x304C;&#x6700;&#x8FD1;&#x306F;VisualVM&#x3084;JMC&#x3067;&#x540C;&#x69D8;&#x306E;&#x4E8B;&#x304C;&#x51FA;&#x6765;&#x308B;&#x306E;&#x3067;&#x5F79;&#x76EE;&#x3092;&#x7D42;&#x3048;&#x305F;&#x611F;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><h3 id="java-visualvm">Java VisualVM</h3><p>Java Mission Control&#x304C;JDK&#x306B;&#x7D71;&#x5408;&#x3055;&#x308C;&#x308B;&#x307E;&#x3067;HotSpot&#x306E;&#x4E3B;&#x529B;&#x3060;&#x3063;&#x305F;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;OSS&#x7248;&#x306F;&#x4E0B;&#x8A18;&#x3067;&#x958B;&#x767A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p><a href="https://visualvm.github.io/index.html" target="_blank">https://visualvm.github.io/index.html</a></p><p>NetBeans Platform&#x3092;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x3057;&#x3066;&#x3044;&#x308B;&#x305F;&#x3081;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x69CB;&#x9020;&#x3092;&#x6301;&#x3063;&#x3066;&#x3044;&#x308B;&#x306E;&#x304C;&#x7279;&#x5FB4;&#x306E;&#x4E00;&#x3064;&#x3067;&#x3059;&#x3002;</p><p>JConsole&#x3068;&#x540C;&#x69D8;&#x306B;JMX&#x306E;&#x60C5;&#x5831;&#x306E;&#x30E2;&#x30CB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x304C;&#x51FA;&#x6765;&#x308B;&#x3053;&#x3068;&#x306B;&#x52A0;&#x3048;&#x3066;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x51FA;&#x529B;&#x3057;&#x305F;&#x308A;&#x89E3;&#x6790;&#x60C5;&#x5831;&#x306E;&#x30B9;&#x30CA;&#x30C3;&#x30D7;&#x30B7;&#x30E7;&#x30C3;&#x30C8;&#x3092;&#x3068;&#x3063;&#x305F;&#x308A;&#x3068;&#x304B;&#x306A;&#x308A;&#x9AD8;&#x6A5F;&#x80FD;&#x306A;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3057;&#x305F;&#x3002;</p><p>JMC&#x304C;HotSpot&#x306B;&#x3082;&#x540C;&#x68B1;&#x3055;&#x308C;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x3066;&#x4EE5;&#x6765;&#x5C11;&#x3057;&#x5F71;&#x304C;&#x8584;&#x304F;&#x306A;&#x308A;&#x307E;&#x3057;&#x305F;&#x304C;&#x3001;GraalVM&#x306B;&#x3082;&#x5BFE;&#x5FDC;&#x3057;&#x3066;&#x304A;&#x308A;&#x6700;&#x65B0;&#x7248;&#x3067;&#x306F;&#x30D7;&#x30EC;&#x30D3;&#x30E5;&#x30FC;&#x7248;&#x306A;&#x304C;&#x3089;JFR&#x306B;&#x3082;&#x5BFE;&#x5FDC;&#x3057;&#x305F;&#x3088;&#x3046;&#x306A;&#x306E;&#x3067;&#x4ECA;&#x5F8C;&#x518D;&#x6CE8;&#x76EE;&#x3055;&#x308C;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x307E;&#x305B;&#x3093;&#x3002;</p><h3 id="jdk-mission-controljmc">JDK Mission Control(JMC)</h3><p>&#x73FE;&#x72B6;&#x306E;Java&#x3067;&#x306F;&#x4E3B;&#x6D41;&#x306E;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;OSS&#x7248;&#x306F;&#x4E0B;&#x8A18;&#x3067;&#x958B;&#x767A;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p><a href="https://github.com/JDKMissionControl/jmc" target="_blank">https://github.com/JDKMissionControl/jmc</a></p><p>&#x5143;&#x3005;&#x3001;JRockit Mission Control&#x3068;&#x547C;&#x3070;&#x308C;JRockit&#x3067;&#x5B9A;&#x8A55;&#x306E;&#x3042;&#x3063;&#x305F;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x30C4;&#x30FC;&#x30EB;&#x3092;Oracle&#x306E;Sun&#x306E;&#x8CB7;&#x53CE;&#x3092;&#x304D;&#x3063;&#x304B;&#x3051;&#x306B;HotSpot&#x5074;&#x306B;&#x53D6;&#x308A;&#x8FBC;&#x3093;&#x3060;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x306A;&#x308A;&#x307E;&#x3059;&#x3002;</p><p>&#x540C;&#x3058;&#x304F;JRockit&#x7531;&#x6765;&#x306E;JFR&#x3068;&#x5BC6;&#x63A5;&#x306B;&#x9023;&#x643A;&#x3002;&#x3002;&#x3068;&#x8A00;&#x3046;&#x304B;JFR&#x306E;&#x30D3;&#x30B8;&#x30E5;&#x30A2;&#x30E9;&#x30A4;&#x30BA;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x3057;&#x3066;&#x306F;&#x307B;&#x307C;&#x4E00;&#x629E;&#x306E;&#x72B6;&#x614B;&#x3067;&#x3059;&#x3002;</p><p>&#x6A5F;&#x80FD;&#x3068;&#x3057;&#x3066;&#x306F;VisualVM&#x3068;&#x540C;&#x69D8;&#x306B;&#x7D71;&#x5408;&#x5206;&#x6790;&#x30C4;&#x30FC;&#x30EB;&#x3068;&#x306A;&#x3063;&#x3066;&#x304A;&#x308A;&#x30EA;&#x30A2;&#x30EB;&#x30BF;&#x30A4;&#x30E0;&#x306E;JMX&#x76E3;&#x8996;&#x3084;&#x30D2;&#x30FC;&#x30D7;&#x30C0;&#x30F3;&#x30D7;&#x304A;&#x3088;&#x3073;JFR&#x306E;&#x53D6;&#x5F97;/&#x5206;&#x6790;&#x304C;&#x53EF;&#x80FD;&#x3067;&#x3059;&#x3002;</p><p>VisualVM&#x3068;&#x306F;&#x5BFE;&#x7167;&#x7684;&#x306B;Eclipse&#x306E;GUI&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30EF;&#x30FC;&#x30AF;&#x3092;&#x30D9;&#x30FC;&#x30B9;&#x306B;&#x3057;&#x3066;&#x304A;&#x308A;&#x540C;&#x3058;&#x304F;&#x67D4;&#x8EDF;&#x306A;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x6A5F;&#x80FD;&#x3092;&#x5099;&#x3048;&#x307E;&#x3059;&#x3002;Weblogic&#x306A;&#x3069;&#x88FD;&#x54C1;&#x306B;&#x7279;&#x5316;&#x3057;&#x305F;&#x30D7;&#x30E9;&#x30B0;&#x30A4;&#x30F3;&#x304C;&#x5B58;&#x5728;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3082;&#x7279;&#x5FB4;&#x306E;&#x4E00;&#x3064;&#x3067;&#x3059;&#x3002;</p><p>HotSpot&#x3078;&#x306E;&#x79FB;&#x690D;&#x304A;&#x3088;&#x3073;OSS&#x5316;&#x306B;&#x4F34;&#x3063;&#x3066;&#x300C;JRockit Mission Control&#x300D; -&gt; &#x300C;Java Mission Control&#x300D; -&gt; &#x300C;JDK Mission Control&#x300D;&#x3068;&#x540D;&#x524D;&#x304C;&#x5909;&#x308F;&#x3063;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x7565;&#x79F0;&#x306F;JMC&#x306E;&#x307E;&#x307E;&#x3067;&#x3059;&#x3002;</p><p>&#x307E;&#x305F;&#x3001;&#x30AA;&#x30FC;&#x30D7;&#x30F3;&#x5316;&#x3055;&#x308C;&#x305F;JMC 7&#x3088;&#x308A;UI&#x304C;&#x5927;&#x304D;&#x304F;&#x5909;&#x308F;&#x3063;&#x3066;&#x304A;&#x308A;&#x3001;&#x81EA;&#x52D5;&#x5206;&#x6790;&#x306E;&#x6A5F;&#x80FD;&#x3082;&#x5F37;&#x5316;&#x3055;&#x308C;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x305F;&#x3060;&#x3057;&#x3001;&#x57F7;&#x7B46;&#x6642;&#x70B9;&#x306E;2019/10/06&#x6642;&#x70B9;&#x3067;&#x307E;&#x3060;&#x6B63;&#x5F0F;&#x7248;&#x304C;&#x30EA;&#x30EA;&#x30FC;&#x30B9;&#x3055;&#x308C;&#x3066;&#x304A;&#x3089;&#x305A;&#x516C;&#x5F0F;&#x304B;&#x3089;&#x30D0;&#x30A4;&#x30CA;&#x30EA;&#x304C;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3067;&#x304D;&#x7121;&#x3044;&#x305F;&#x3081;&#x81EA;&#x5206;&#x3067;&#x30D3;&#x30EB;&#x30C9;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3068;&#x8A00;&#x3046;&#x72B6;&#x614B;&#x304C;&#x7D9A;&#x3044;&#x3066;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x5F53;&#x9762;&#x306F;OpenJDK&#x30C7;&#x30A3;&#x30B9;&#x30C8;&#x30EA;&#x30D3;&#x30E5;&#x30FC;&#x30BF;&#x304C;&#x30D3;&#x30EB;&#x30C9;&#x3057;&#x3066;&#x3044;&#x308B;&#x300C;Zulu Mission Control&#x300D;&#x3084;&#x300C;Liberica Mission Control&#x300D;&#x3092;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x4FBF;&#x5229;&#x3060;&#x3068;&#x601D;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p><h3 id="jcmd">jcmd</h3><p>jcmd&#x306F;JFR&#x3068;&#x540C;&#x69D8;&#x306B;&#x5143;&#x3005;&#x306F;JRockit&#x3067;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x305F;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;&#x305D;&#x306E;&#x305F;&#x3081;&#x65E2;&#x5B58;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3068;&#x6A5F;&#x80FD;&#x304C;&#x91CD;&#x8907;&#x3057;&#x3066;&#x3044;&#x307E;&#x3059;&#x304C;&#x3001;&#x7D71;&#x5408;&#x3055;&#x308C;&#x3066;&#x3044;&#x3066;&#x4FBF;&#x5229;&#x306A;&#x306E;&#x3067;jcmd&#x3067;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x3092;&#x6E08;&#x307E;&#x305B;&#x308B;&#x4E8B;&#x304C;&#x591A;&#x3044;&#x6C17;&#x304C;&#x3057;&#x307E;&#x3059;&#x3002;</p><p>&#x4EE3;&#x8868;&#x7684;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3068;&#x3057;&#x3066;&#x306F;<code>JFR&#x306E;&#x64CD;&#x4F5C;</code>, <code>jps&#x306E;&#x3088;&#x3046;&#x306A;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x306E;&#x53D6;&#x5F97;</code>, <code>jstack&#x306E;&#x3088;&#x3046;&#x306B;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x306E;&#x53D6;&#x5F97;</code>&#x306A;&#x3069;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p><h3 id="hprof">hprof</h3><p>&#x53E4;&#x304F;&#x304B;&#x3089;&#x3042;&#x308B;Java&#x6A19;&#x6E96;&#x306E;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30EA;&#x30F3;&#x30B0;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;CPU&#x4F7F;&#x7528;&#x7387;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x60C5;&#x5831;&#x3001;&#x30D2;&#x30FC;&#x30D7;&#x30C0;&#x30F3;&#x30D7;&#x306A;&#x3069;&#x3092;&#x53D6;&#x5F97;/&#x5206;&#x6790;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x305F;&#x3060;&#x3057;&#x3001;&#x304B;&#x306A;&#x308A;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x304C;&#x5927;&#x304D;&#x304F;&#x672C;&#x756A;&#x306B;&#x9069;&#x7528;&#x3067;&#x304D;&#x308B;&#x30BF;&#x30A4;&#x30D7;&#x306E;&#x3082;&#x306E;&#x3067;&#x306F;&#x3042;&#x308A;&#x307E;&#x305B;&#x3093;&#x3002;&#x307E;&#x305F;&#x958B;&#x767A;&#x3084;&#x30C6;&#x30B9;&#x30C8;&#x6642;&#x3082;&#x73FE;&#x5728;&#x306A;&#x3089;IDE&#x306B;&#x4ED8;&#x5C5E;&#x3057;&#x305F;&#x30D7;&#x30ED;&#x30D5;&#x30A1;&#x30A4;&#x30E9;&#x306E;&#x65B9;&#x304C;&#x4F7F;&#x3044;&#x52DD;&#x624B;&#x306F;&#x826F;&#x3044;&#x3068;&#x601D;&#x308F;&#x308C;&#x307E;&#x3059;&#x3002;</p><h3 id="jps">jps</h3><p>JVM&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;ID&#x3092;&#x8868;&#x793A;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;Linux&#x306E;&#x5834;&#x5408;&#x3001;ps&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3082;&#x3082;&#x3061;&#x308D;&#x3093;&#x7279;&#x5B9A;&#x3067;&#x304D;&#x307E;&#x3059;&#x304C;Java&#x4EE5;&#x5916;&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x306A;&#x3044;&#x306E;&#x3067;&#x30D5;&#x30A3;&#x30EB;&#x30BF;&#x306B;&#x4FBF;&#x5229;&#x3067;&#x3059;&#x3002;</p><h3 id="jstat">jstat</h3><p>GC&#x3092;&#x542B;&#x3080;&#x30D2;&#x30FC;&#x30D7;&#x306E;&#x60C5;&#x5831;&#x3092;&#x307F;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;Java&#x306E;&#x30E1;&#x30E2;&#x30EA;&#x69CB;&#x9020;&#x306F;&#x69D8;&#x3005;&#x306A;&#x968E;&#x5C64;&#x304C;&#x3042;&#x308A;&#x8907;&#x96D1;&#x3067;&#x3059;&#x304C;&#x305D;&#x308C;&#x3092;&#x30E2;&#x30CB;&#x30BF;&#x30EA;&#x30F3;&#x30B0;&#x3059;&#x308B;&#x4E8B;&#x304C;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x500B;&#x4EBA;&#x7684;&#x306B;&#x306F;&#x76E3;&#x8996;&#x30C4;&#x30FC;&#x30EB;&#x7D4C;&#x7531;&#x3067;JMX&#x304B;JFR&#x3067;&#x898B;&#x308B;&#x4E8B;&#x304C;&#x591A;&#x3044;&#x306E;&#x3067;&#x3042;&#x307E;&#x308A;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x306F;&#x7121;&#x3044;&#x304B;&#x3068;&#x601D;&#x3044;&#x307E;&#x3059;&#x3002;</p><h3 id="jstack">jstack</h3><p>JVM&#x306E;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3067;&#x3059;&#x3002;</p><p>&#x30C7;&#x30C3;&#x30C9;&#x30ED;&#x30C3;&#x30AF;&#x306A;&#x3069;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30ED;&#x30C3;&#x30AF;&#x3092;&#x5206;&#x6790;&#x3059;&#x308B;&#x3068;&#x304D;&#x306B;&#x826F;&#x304F;&#x4F7F;&#x7528;&#x3057;&#x307E;&#x3059;&#x3002;&#x5358;&#x72EC;&#x3067;&#x4F7F;&#x3046;&#x3068;&#x8A00;&#x3046;&#x3088;&#x308A;&#x306F;&#x53D6;&#x5F97;&#x3057;&#x305F;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x300C;&#x4F8D;&#x300D;&#x300C;ThreadLogic&#x300D;&#x300C;TDA&#x300D;&#x3042;&#x305F;&#x308A;&#x306B;&#x6E21;&#x3057;&#x3066;&#x4F7F;&#x3044;&#x307E;&#x3059;&#x3002;</p><p>&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x30C0;&#x30F3;&#x30D7;&#x306F;&#x969C;&#x5BB3;&#x6642;&#x306E;&#x91CD;&#x8981;&#x306A;&#x60C5;&#x5831;&#x306B;&#x306A;&#x308B;&#x306E;&#x3067;&#x5B9A;&#x671F;&#x5B9F;&#x884C;&#x3092;&#x3059;&#x308B;&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x3092;&#x7D44;&#x3080;&#x304B;&#x3001;&#x969C;&#x5BB3;&#x6642;&#x306B;&#x6570;&#x56DE;&#x53E9;&#x3044;&#x3066;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x306E;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3057;&#x307E;&#x3059;&#x3002;</p><h3 id="jmap">jmap</h3><p>jmap&#x306F;&#x30D2;&#x30FC;&#x30D7;&#x30C0;&#x30F3;&#x30D7;&#x3092;&#x53D6;&#x5F97;&#x3059;&#x308B;&#x305F;&#x3081;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x3059;&#x3002;</p><p>&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x60C5;&#x5831;&#x3084;&#x30D2;&#x30FC;&#x30D7;&#x60C5;&#x5831;&#x3001;&#x30AF;&#x30E9;&#x30B9;&#x30ED;&#x30FC;&#x30C0;&#x306E;&#x60C5;&#x5831;&#x3092;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x30D2;&#x30FC;&#x30D7;&#x30B5;&#x30DE;&#x30EA;&#x30FC;&#x3001;&#x30D2;&#x30B9;&#x30C8;&#x30B0;&#x30E9;&#x30E0;&#x3001;&#x7D71;&#x8A08;&#x60C5;&#x5831;&#x3068;&#x69D8;&#x3005;&#x306A;&#x60C5;&#x5831;&#x304C;&#x53D6;&#x5F97;&#x3067;&#x304D;&#x307E;&#x3059;&#x3002;</p><p>&#x51FA;&#x529B;&#x7D50;&#x679C;&#x306F;jhat&#x3084;&#x30B5;&#x30FC;&#x30C9;&#x30D1;&#x30FC;&#x30C6;&#x30A3;&#x30FC;&#x30C4;&#x30FC;&#x30EB;&#x3067;&#x5206;&#x6790;&#x3059;&#x308B;&#x306E;&#x304C;&#x4E00;&#x822C;&#x7684;&#x3067;&#x3059;&#x3002;&#x305F;&#x3060;&#x3057;&#x3001;jmap&#x306F;&#x30D5;&#x30EB;GC&#x3092;&#x5F15;&#x304D;&#x8D77;&#x3053;&#x3059;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x305F;&#x3081;&#x672C;&#x756A;&#x3067;&#x306E;&#x5229;&#x7528;&#x306F;&#x6CE8;&#x610F;&#x3057;&#x3066;&#x884C;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308A;&#x307E;&#x3059;&#x3002;</p>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="01-what_is_JFR.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 1.1 JDK Flight Recorder">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2 Javaにおけるパフォーマンス分析と障害診断","level":"1.3.2","depth":2,"next":{"title":"2章　JDK Flight Recorderのアーキテクチャ","level":"1.4","depth":1,"ref":"","articles":[{"title":"2.2 JFR アーキテクチャ概要","level":"1.4.1","depth":2,"path":"02/01-jfr-architecture.md","ref":"02/01-jfr-architecture.md","articles":[]}]},"previous":{"title":"1.1 JDK Flight Recorder","level":"1.3.1","depth":2,"path":"01/01-what_is_JFR.md","ref":"01/01-what_is_JFR.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"01/02-other-tools.md","mtime":"2019-10-13T04:35:38.835Z","type":"markdown"},"gitbook":{"version":"3.2.0","time":"2019-10-13T04:35:55.131Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

